{
    "events":[
        {
            "desc": " Congratulations! You have just graduated from a prestigious university in Canada earning you a degree in STEM. It is now time for you to begin your career journey and climb the corporate ladder. What career are you going into?",
            "locked":true,
            "preReq":{
                "health": 0,
                "rep": 0,
                "money": 0
            },
            "options":[
                {
                    "desc":"Sciences",
                    "resultDesc":"After studying for many years and accumulating tons of debt, you have been hired as a researcher for a big science organization. Biology and Chemistry career are most common for women as 60% and 50% of degrees respectively are earned by women.",
                    "health": 0,
                    "rep":0,
                    "money":0
                },
                {
                    "desc":"Engineering",
                    "resultDesc":"After studying for many years and accumulating tons of debt, you have been hired as a mechanical engineer for a car manufacturer. Only around 1 in 5 of engineering degrees are earned by women.",
                    "health": 0,
                    "rep":0,
                    "money":0
                },
                {
                    "desc":"Computer Science",
                    "resultDesc":"Only 38% of women who major in computers actually work in computers; However, after studying for many years to earn your degree and going through many interview processes, you have been hired to work in an entry level position in a large tech company.",
                    "health": 0,
                    "rep":0,
                    "money":0
                }
            ]
        },
        {
            "desc": "One of your male co-workers, Justin Lin💀, approaches you and asks if you want to go out for dinner with him after work 👀. Despite repeatedly refusing, he stays persistent. How do you respond?",
            "locked":false,
            "preReq":{
                "day": 1,
                "health": 0,
                "rep": 0,
                "money": 0
            },
            "options":[
                {
                    "desc":"Give in, say Yes",
                    "health": -20,
                    "rep":5,
                    "money":0,
                    "resultDesc":"You begrudgingly say yes and schedule a date."
                },
                {
                    "desc":"Keep Refusing",
                    "health": 0,
                    "rep":-10,
                    "money":0,
                    "resultDesc":"He keeps on pushing but you stay strong on your stance until he eventually gives up. 36% of women in STEM say sexual harassment is a problem in their workplace."
                    
                },
                {
                    "desc":"Report to HR",
                    "health": -5,
                    "rep":-30,
                    "money":0,
                    "resultDesc":"You report him to HR and he gets a warning. You notice that coworkers around you are becoming less friendly and uneasy around you."

                    
                }
            ]
        },
        {
            "desc": "Event 3",
            "locked":false,
            "preReq":{
                "health": 0,
                "rep": 0,
                "money": 0
            },
            "options":[
                {
                    "desc":"Option 1",
                    "health": 1,
                    "rep":-1,
                    "money":1,
                    "resultDesc":"Result of the Choice 3"
                },
                {
                    "desc":"Option 2",
                    "health": 0,
                    "rep":50,
                    "money":0,
                    "resultDesc":"Result of the Choice 2",
                    "nextEvent":2
                }
            ]
        }
    ]
}