{
    "events":[
        {
            "desc": "On February 22nd 2005, a baby girl was born into a middle-class suburban household in Ontario, Canada. Growing up you go through school studying hard and working toward you dream career of...",
            "locked":true,
            "preReq":{
                "day": 0,
                "health": 0,
                "rep": 0,
                "salary": 0
            },
            "options":[
                {
                    "desc":"House Wife",
                    "health": 0,
                    "rep":0,
                    "salary":0,
                    "resultDesc":"You decided to become a house wife.",
                    "nextEvent": 1
                },
                {
                    "desc":"Baby Sitter",
                    "health": 0,
                    "rep":0,
                    "salary":0,
                    "resultDesc":"You decided to become a babysitter.",
                    "nextEvent": 1
                    
                },
                {
                    "desc":"Teacher",
                    "health": 0,
                    "rep":0,
                    "salary":0,
                    "resultDesc":"You decided to become a teacher.",
                    "nextEvent": 1
                },
                {
                    "desc":"STEM",
                    "health": 0,
                    "rep":0,
                    "salary":0,
                    "resultDesc":"You decided to go into STEM.",
                    "nextEvent": 4

                    
                }
            ]
        },
        {
            "desc": "You live the life of a stereotypical women trapped within the patriarchal society.",
            "locked":true,
            "preReq":{
                "day": 0,
                "health": 0,
                "rep": 0,
                "salary": 0
            },
            "options":[
                {
                    "desc":"Continue",
                    "health": 0,
                    "rep":0,
                    "salary":0,
                    "resultDesc":"Play Again."
                }
            ]
        }
        ,
        {
            "desc": "Your open you email and notice a suspicious new email from your boss scheduling a meeting with you today at 5:00pm. You respond and anxiously wait for the time to come.",
            "locked":true,
            "preReq":{
                "day": 0,
                "health": 0,
                "rep": 0,
                "salary": 0
            },
            "options":[
                {
                    "desc":"Continue",
                    "health": 0,
                    "rep":0,
                    "salary":0,
                    "resultDesc":"You have been fired💀."
                }
            ]
        },
        {
            "desc": "For the past few weeks you feel as though work has been taking a significant toll on your mental health inside and outside of work. You decide that the gender in-equality in STEM and the effects it has on you is too much.",
            "locked":true,
            "preReq":{
                "day": 0,
                "health": 0,
                "rep": 0,
                "salary": 0
            },
            "options":[
                {
                    "desc":"Continue",
                    "health": 0,
                    "rep":0,
                    "salary":0,
                    "resultDesc":"You quit your job💀."
                }
            ]
        },
        {
            "desc": " Congratulations! You have just graduated from a prestigious university in Canada earning you a degree in STEM. It is now time for you to begin your career journey and climb the corporate ladder. What career are you going into?",
            "locked":true,
            "preReq":{
                "health": 0,
                "rep": 0,
                "salary": 0
            },
            "options":[
                {
                    "desc":"Sciences",
                    "resultDesc":"After studying for many years and accumulating tons of debt, you have been hired as a researcher for a big science organization. Biology and Chemistry career are most common for women as 60% and 50% of degrees respectively are earned by women. The average annual salary of a women in sciences is $59,242.",
                    "health": 0,
                    "rep":0,
                    "salary":59241
                },
                {
                    "desc":"Engineering",
                    "resultDesc":"After studying for many years and accumulating tons of debt, you have been hired as a mechanical engineer for a car manufacturer. Only around 1 in 5 of engineering degrees are earned by women. The average annual salary of a women in engineering is $69,416.",
                    "health": 0,
                    "rep":0,
                    "salary":69415
                },
                {
                    "desc":"Computer Science",
                    "resultDesc":"The Computer field is one of the most male dominated fields. Only about 38% of women who major in computers actually work in computers; However, after studying for many years to earn your degree and going through many interview processes, you have been hired to work in an entry level position in a large tech company. The average annual salary of a women in computers is $86,157.",
                    "health": 0,
                    "rep":0,
                    "salary":86156
                }
                
            ]
        }
        ,
        {
            "desc": "One of your male co-workers, Justin Lin💀, approaches you and asks if you want to go out for dinner with him after work 👀. Despite repeatedly refusing, he stays persistent. How do you respond?",
            "locked":false,
            "preReq":{
                "day": 0,
                "health": 0,
                "rep": 0,
                "salary": 0
            },
            "options":[
                {
                    "desc":"Give in, say Yes",
                    "health": -20,
                    "rep":10,
                    "salary":0,
                    "resultDesc":"You begrudgingly say yes and schedule a date."
                },
                {
                    "desc":"Keep Refusing",
                    "health": 0,
                    "rep":-10,
                    "salary":0,
                    "resultDesc":"He keeps on pushing but you stay strong on your stance until he eventually gives up. 36% of women in STEM say sexual harassment is a problem in their workplace."
                    
                },
                {
                    "desc":"Report to HR",
                    "health": -5,
                    "rep":-30,
                    "salary":0,
                    "resultDesc":"You report him to HR and he gets a warning. You notice that coworkers around you are becoming less friendly and uneasy around you."

                    
                }
            ]
        },
        {
            "desc": "During a pivotal project meeting, your boss delegates a highly intricate task to you. In response, one of your colleagues passive-aggressively interjects, implying a lack of confidence in your ability to handle such a challenging assignment. How do you respond?",
            "locked":false,
            "preReq":{
                "day": 0,
                "health": 0,
                "rep": 0,
                "salary": 0
            },
            "options":[
                {
                    "desc":"Ignore",
                    "health": -5,
                    "rep":5,
                    "salary":0,
                    "resultDesc":"You say nothing and your boss assigns you a entry level task that takes you only a couple hours. 29% of women in STEM workplaces say they were treated as not competent."
                },
                {
                    "desc":"Confront in meeting",
                    "health": 5,
                    "rep":10,
                    "salary":0,
                    "resultDesc":"You immediately stand up stating you are more than qualified to complete this task. Your stunned co-workers are silent for a moment and give you the difficult task. 64% of women believe that they feel the need to prove themselves at work in STEM jobs."
                },
                {
                    "desc":"Confront after meeting",
                    "health": 0,
                    "rep":-5,
                    "salary":0,
                    "resultDesc":"You wait until the meeting is over to confront your co-worker once everyone leaves. You tell him how you didn’t appreciate his comments and would like to be treated as equals. He says that the meeting is over and there’s nothing he can do about it then gives a half-hearted apology."
                }
            ]
        },
        {
            "desc": "After work, you decide to look over your paycheck from last week. You notice that you make marginally less than you male co-worker in the same position. How do you respond?",
            "locked":false,
            "preReq":{
                "day": 0,
                "health": 0,
                "rep": 0,
                "salary": 0
            },
            "options":[
                {
                    "desc":"Ignore",
                    "health": -5,
                    "rep":5,
                    "salary":0,
                    "resultDesc":"You decide its not worth the risk to confront and you make enough as is. 29% of women make less money than a male doing the same job."
                },
                {
                    "desc":"Confront your boss",
                    "health": 0,
                    "rep":0,
                    "salary":0,
                    "resultDesc":"You arrange a meeting with your boss to discuss the disparity in your compensation. Throughout the conversation, he evades the topic until eventually concluding by saying he will look into it."
                }
            ]
        },
        {
            "desc": "In light of a recent event where one of the women in your predominantly male workplace was terminated, you find yourself growing increasingly concerned about the noticeable absence of gender diversity within your organization. How do you respond?",
            "locked":false,
            "preReq":{
                "day": 0,
                "health": 0,
                "rep": 0,
                "salary": 0
            },
            "options":[
                {
                    "desc":"Ignore",
                    "health": 0,
                    "rep":5,
                    "salary":0,
                    "resultDesc":"You decide its not worth the risk to confront and you like your job anyway. 31% of women say their workplace pays too little attention to increasing gender diversity."
                },
                {
                    "desc":"Confront your boss",
                    "health": 0,
                    "rep":0,
                    "salary":0,
                    "resultDesc":"You arrange a meeting with your boss to address the lack of gender diversity. Your boss tells you that there is no issue and every worker here is treated equally no matter their gender. 31% of women say their workplace pays too little attention to increasing gender diversity. "
                }
            ]
        },
        {
            "desc": "Your open you email and notice a suspicious new email from your boss scheduling a meeting with you today at 5:00pm. At the meeting, he tells you that he want the recognize the high quality work you have been doing during your time working here.",
            "locked":false,
            "preReq":{
                "day": 5,
                "health": 0,
                "rep": 100,
                "salary": 0
            },
            "options":[
                {
                    "desc":"Continue",
                    "health": 0,
                    "rep":-50,
                    "salary":0.3,
                    "resultDesc":"You have been given a promotion and raise🥳. "
                }
            ]
        },
        {
            "desc": "Today, one of your male co-workers got a promotion despite doing less work than you. How do you respond?",
            "locked":false,
            "preReq":{
                "day": 0,
                "health": 0,
                "rep": 0,
                "salary": 0
            },
            "options":[
                {
                    "desc":"Ignore",
                    "health": -10,
                    "rep":5,
                    "salary":0,
                    "resultDesc":"You decide its not worth the risk to confront and you make good money anyway. Only 38% of women say that women are usually treated fairly for opportunities for promotion and advancement in a mostly male workplace."
                },
                {
                    "desc":"Confront your boss",
                    "health": -5,
                    "rep":0,
                    "salary":0,
                    "resultDesc":"You arrange a meeting with your boss to voice your frustration. He tells you to keep working hard and eventually you will be rewarded. Only 38% of women say that women are usually treated fairly for opportunities for promotion and advancement in a mostly male workplace."
                }
            ]
        },
        {
            "desc": "Template",
            "locked":true,
            "preReq":{
                "day": 0,
                "health": 0,
                "rep": 0,
                "salary": 0
            },
            "options":[
                {
                    "desc":"Option1",
                    "health": 0,
                    "rep":0,
                    "salary":0,
                    "resultDesc":"Result of the Choice 3"
                },
                {
                    "desc":"Option2",
                    "health": 0,
                    "rep":0,
                    "salary":0,
                    "resultDesc":"Result of the Choice 2"
                }
            ]
        }
    ]
}